In [1]:
import pandas as pd
import numpy as np

# DataFrame MultiIndex

In [2]:
lista = [['BRASIL','BRASIL','BRASIL','ARGENTINA','ARGENTINA','ARGENTINA'],[2017,2018,2019,2017,2018,2019]]

In [16]:
tuplas = zip(*lista)

In [17]:
tuplas

In [18]:
tuplas = list(tuplas)

In [19]:
tuplas

[('BRASIL', 2017),
 ('BRASIL', 2018),
 ('BRASIL', 2019),
 ('ARGENTINA', 2017),
 ('ARGENTINA', 2018),
 ('ARGENTINA', 2019)]

In [20]:
multi = pd.MultiIndex.from_tuples(tuplas)

In [21]:
multi

MultiIndex([(   'BRASIL', 2017),
            (   'BRASIL', 2018),
            (   'BRASIL', 2019),
            ('ARGENTINA', 2017),
            ('ARGENTINA', 2018),
            ('ARGENTINA', 2019)],
           )

In [23]:
df1 = pd.DataFrame(data = np.random.randn(6,2),index = multi, columns = ['EXP TRIGO', 'EXP ARROZ'])

In [24]:
df1

                EXP TRIGO  EXP ARROZ
BRASIL    2017   0.194114  -0.642256
          2018  -1.298866  -1.786469
          2019   0.166542  -0.884378
ARGENTINA 2017  -0.080121   0.250484
          2018  -0.000506  -0.118091
          2019  -0.295642  -0.457865

In [25]:
df1.index.names = ['PAÍS','ANO']

In [26]:
df1

                EXP TRIGO  EXP ARROZ
PAÍS      ANO
BRASIL    2017   0.194114  -0.642256
          2018  -1.298866  -1.786469
          2019   0.166542  -0.884378
ARGENTINA 2017  -0.080121   0.250484
          2018  -0.000506  -0.118091
          2019  -0.295642  -0.457865

### Encontrando valores

In [28]:
df1['EXP ARROZ']

PAÍS       ANO
BRASIL     2017   -0.642256
           2018   -1.786469
           2019   -0.884378
ARGENTINA  2017    0.250484
           2018   -0.118091
           2019   -0.457865
Name: EXP ARROZ, dtype: float64

In [29]:
df1.loc['BRASIL']

      EXP TRIGO  EXP ARROZ
ANO
2017   0.194114  -0.642256
2018  -1.298866  -1.786469
2019   0.166542  -0.884378

In [30]:
df1.xs(2017,level=1)

           EXP TRIGO  EXP ARROZ
PAÍS
BRASIL      0.194114  -0.642256
ARGENTINA  -0.080121   0.250484

In [31]:
df1[:2]

             EXP TRIGO  EXP ARROZ
PAÍS   ANO
BRASIL 2017   0.194114  -0.642256
       2018  -1.298866  -1.786469

In [32]:
df1[0:5]

                EXP TRIGO  EXP ARROZ
PAÍS      ANO
BRASIL    2017   0.194114  -0.642256
          2018  -1.298866  -1.786469
          2019   0.166542  -0.884378
ARGENTINA 2017  -0.080121   0.250484
          2018  -0.000506  -0.118091

In [33]:
df1[:]

                EXP TRIGO  EXP ARROZ
PAÍS      ANO
BRASIL    2017   0.194114  -0.642256
          2018  -1.298866  -1.786469
          2019   0.166542  -0.884378
ARGENTINA 2017  -0.080121   0.250484
          2018  -0.000506  -0.118091
          2019  -0.295642  -0.457865

In [34]:
df1[['EXP TRIGO','EXP ARROZ']]

                EXP TRIGO  EXP ARROZ
PAÍS      ANO
BRASIL    2017   0.194114  -0.642256
          2018  -1.298866  -1.786469
          2019   0.166542  -0.884378
ARGENTINA 2017  -0.080121   0.250484
          2018  -0.000506  -0.118091
          2019  -0.295642  -0.457865

### Vendo o DF de outra maneira

In [36]:
df1.unstack()

          EXP TRIGO                     EXP ARROZ
ANO            2017      2018      2019      2017      2018      2019
PAÍS
ARGENTINA -0.080121 -0.000506 -0.295642  0.250484 -0.118091 -0.457865
BRASIL     0.194114 -1.298866  0.166542 -0.642256 -1.786469 -0.884378

In [37]:
df2 = df1.unstack()

In [38]:
df2

          EXP TRIGO                     EXP ARROZ
ANO            2017      2018      2019      2017      2018      2019
PAÍS
ARGENTINA -0.080121 -0.000506 -0.295642  0.250484 -0.118091 -0.457865
BRASIL     0.194114 -1.298866  0.166542 -0.642256 -1.786469 -0.884378

In [39]:
df2['EXP TRIGO']

ANO            2017      2018      2019
PAÍS
ARGENTINA -0.080121 -0.000506 -0.295642
BRASIL     0.194114 -1.298866  0.166542

In [43]:
df2.xs(2017,axis=1,level=1)

           EXP TRIGO  EXP ARROZ
PAÍS
ARGENTINA  -0.080121   0.250484
BRASIL      0.194114  -0.642256